In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-05 -1.387399  1.152705  1.637160  0.906813
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,'B' : pd.Timestamp('20130102'),'C' : pd.Series(1,index=list(range(4)),dtype='float32'),'D' : np.array([3] * 4,dtype='int32'),
   'E' : pd.Categorical(["test","train","test","train"]),
   'F' : 'foo' })

In [6]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### df2. 'press tab'

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-05 -1.387399  1.152705  1.637160  0.906813

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-05 -1.387399  1.152705  1.637160  0.906813
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.values

array([[ 0.20851509, -1.02149739,  0.47692493,  1.09482695],
       [ 1.00572584,  0.18077417,  0.32654425,  1.08615252],
       [-0.6284942 ,  0.62943081,  0.76278937, -0.09383263],
       [ 0.2581768 ,  0.41843818, -0.60697007,  0.08088224],
       [-1.38739886,  1.15270499,  1.63715974,  0.90681289],
       [-0.90884196, -1.78976264, -1.60829529, -0.29221154]])

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.242053 -0.071652  0.164692  0.463772
std    0.884981  1.108926  1.130355  0.634178
min   -1.387399 -1.789763 -1.608295 -0.292212
25%   -0.838755 -0.720929 -0.373591 -0.050154
50%   -0.209990  0.299606  0.401735  0.493848
75%    0.245761  0.576683  0.691323  1.041318
max    1.005726  1.152705  1.637160  1.094827

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.208515    1.005726   -0.628494    0.258177   -1.387399   -0.908842
B   -1.021497    0.180774    0.629431    0.418438    1.152705   -1.789763
C    0.476925    0.326544    0.762789   -0.606970    1.637160   -1.608295
D    1.094827    1.086153   -0.093833    0.080882    0.906813   -0.292212

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.094827  0.476925 -1.021497  0.208515
2013-01-02  1.086153  0.326544  0.180774  1.005726
2013-01-03 -0.093833  0.762789  0.629431 -0.628494
2013-01-04  0.080882 -0.606970  0.418438  0.258177
2013-01-05  0.906813  1.637160  1.152705 -1.387399
2013-01-06 -0.292212 -1.608295 -1.789763 -0.908842

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-05 -1.387399  1.152705  1.637160  0.906813

In [18]:
df['A']

2013-01-01    0.208515
2013-01-02    1.005726
2013-01-03   -0.628494
2013-01-04    0.258177
2013-01-05   -1.387399
2013-01-06   -0.908842
Freq: D, Name: A, dtype: float64

In [19]:
df['C']

2013-01-01    0.476925
2013-01-02    0.326544
2013-01-03    0.762789
2013-01-04   -0.606970
2013-01-05    1.637160
2013-01-06   -1.608295
Freq: D, Name: C, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833

In [26]:
df['20130101':'20130104']

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-04  0.258177  0.418438 -0.606970  0.080882

In [31]:
df.loc[dates[3]]

A    0.258177
B    0.418438
C   -0.606970
D    0.080882
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.208515 -1.021497
2013-01-02  1.005726  0.180774
2013-01-03 -0.628494  0.629431
2013-01-04  0.258177  0.418438
2013-01-05 -1.387399  1.152705
2013-01-06 -0.908842 -1.789763

In [36]:
df.loc['20130101':'20130103',['A','B']]

                   A         B
2013-01-01  0.208515 -1.021497
2013-01-02  1.005726  0.180774
2013-01-03 -0.628494  0.629431

In [37]:
df.loc['20130101',['A','B']]

A    0.208515
B   -1.021497
Name: 2013-01-01 00:00:00, dtype: float64

In [38]:
df.loc[dates[0],'A']

0.20851508981734665

In [40]:
# same as above
df.at[dates[0],'A']

0.20851508981734665

In [51]:
df.iloc[:]

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-05 -1.387399  1.152705  1.637160  0.906813
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212

In [52]:
df.iloc[0]

A    0.208515
B   -1.021497
C    0.476925
D    1.094827
Name: 2013-01-01 00:00:00, dtype: float64

In [57]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.258177  0.418438
2013-01-05 -1.387399  1.152705

In [65]:
df.iloc[[0,3,5],[0,3]]

                   A         D
2013-01-01  0.208515  1.094827
2013-01-04  0.258177  0.080882
2013-01-06 -0.908842 -0.292212

In [66]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833

In [67]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.021497  0.476925
2013-01-02  0.180774  0.326544
2013-01-03  0.629431  0.762789
2013-01-04  0.418438 -0.606970
2013-01-05  1.152705  1.637160
2013-01-06 -1.789763 -1.608295

In [68]:
df.iloc[1,1]

0.1807741714796384

In [70]:
df.head()

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-05 -1.387399  1.152705  1.637160  0.906813

In [69]:
df.iloc[0,0]

0.20851508981734665

In [71]:
df.iat[0,0]

0.20851508981734665

In [72]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-04  0.258177  0.418438 -0.606970  0.080882

In [73]:
df.head()

                   A         B         C         D
2013-01-01  0.208515 -1.021497  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03 -0.628494  0.629431  0.762789 -0.093833
2013-01-04  0.258177  0.418438 -0.606970  0.080882
2013-01-05 -1.387399  1.152705  1.637160  0.906813

In [74]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.208515       NaN  0.476925  1.094827
2013-01-02  1.005726  0.180774  0.326544  1.086153
2013-01-03       NaN  0.629431  0.762789       NaN
2013-01-04  0.258177  0.418438       NaN  0.080882
2013-01-05       NaN  1.152705  1.637160  0.906813
2013-01-06       NaN       NaN       NaN       NaN

In [75]:
df2 = df.copy()

In [76]:
df2['E'] = ['one','one','two','three','four','three']

In [77]:
df2

                   A         B         C         D      E
2013-01-01  0.208515 -1.021497  0.476925  1.094827    one
2013-01-02  1.005726  0.180774  0.326544  1.086153    one
2013-01-03 -0.628494  0.629431  0.762789 -0.093833    two
2013-01-04  0.258177  0.418438 -0.606970  0.080882  three
2013-01-05 -1.387399  1.152705  1.637160  0.906813   four
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212  three

In [80]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.628494  0.629431  0.762789 -0.093833   two
2013-01-05 -1.387399  1.152705  1.637160  0.906813  four

In [82]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [83]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.208515 -1.021497  0.476925  1.094827  NaN
2013-01-02  1.005726  0.180774  0.326544  1.086153  1.0
2013-01-03 -0.628494  0.629431  0.762789 -0.093833  2.0
2013-01-04  0.258177  0.418438 -0.606970  0.080882  3.0
2013-01-05 -1.387399  1.152705  1.637160  0.906813  4.0
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212  5.0

In [85]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.021497  0.476925  1.094827  NaN
2013-01-02  1.005726  0.180774  0.326544  1.086153  1.0
2013-01-03 -0.628494  0.629431  0.762789 -0.093833  2.0
2013-01-04  0.258177  0.418438 -0.606970  0.080882  3.0
2013-01-05 -1.387399  1.152705  1.637160  0.906813  4.0
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212  5.0

In [89]:
df.iat[0,1] = 4
df

                   A         B         C         D    F
2013-01-01  0.000000  4.000000  0.476925  1.094827  NaN
2013-01-02  1.005726  0.180774  0.326544  1.086153  1.0
2013-01-03 -0.628494  0.629431  0.762789 -0.093833  2.0
2013-01-04  0.258177  0.418438 -0.606970  0.080882  3.0
2013-01-05 -1.387399  1.152705  1.637160  0.906813  4.0
2013-01-06 -0.908842 -1.789763 -1.608295 -0.292212  5.0

In [91]:
df.loc[:,'D'] = np.array([5] * len(df))
print(len(df))
df

6

                   A         B         C  D    F
2013-01-01  0.000000  4.000000  0.476925  5  NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0
2013-01-03 -0.628494  0.629431  0.762789  5  2.0
2013-01-04  0.258177  0.418438 -0.606970  5  3.0
2013-01-05 -1.387399  1.152705  1.637160  5  4.0
2013-01-06 -0.908842 -1.789763 -1.608295  5  5.0

In [92]:
df

                   A         B         C  D    F
2013-01-01  0.000000  4.000000  0.476925  5  NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0
2013-01-03 -0.628494  0.629431  0.762789  5  2.0
2013-01-04  0.258177  0.418438 -0.606970  5  3.0
2013-01-05 -1.387399  1.152705  1.637160  5  4.0
2013-01-06 -0.908842 -1.789763 -1.608295  5  5.0

In [93]:
df2 = df.copy()

In [94]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  4.000000  0.476925  5  NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0
2013-01-03 -0.628494  0.629431  0.762789  5  2.0
2013-01-04  0.258177  0.418438 -0.606970  5  3.0
2013-01-05 -1.387399  1.152705  1.637160  5  4.0
2013-01-06 -0.908842 -1.789763 -1.608295  5  5.0

In [95]:
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000 -4.000000 -0.476925 -5  NaN
2013-01-02 -1.005726 -0.180774 -0.326544 -5 -1.0
2013-01-03 -0.628494 -0.629431 -0.762789 -5 -2.0
2013-01-04 -0.258177 -0.418438 -0.606970 -5 -3.0
2013-01-05 -1.387399 -1.152705 -1.637160 -5 -4.0
2013-01-06 -0.908842 -1.789763 -1.608295 -5 -5.0

In [102]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+ ['E'])

In [105]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  4.000000  0.476925  5  NaN NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0 NaN
2013-01-03 -0.628494  0.629431  0.762789  5  2.0 NaN
2013-01-04  0.258177  0.418438 -0.606970  5  3.0 NaN

In [106]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [107]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  4.000000  0.476925  5  5.0  5.0
2013-01-02  1.005726  0.180774  0.326544  5  1.0  5.0
2013-01-03 -0.628494  0.629431  0.762789  5  2.0  5.0
2013-01-04  0.258177  0.418438 -0.606970  5  3.0  5.0

In [108]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  4.000000  0.476925  5  NaN NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0 NaN
2013-01-03 -0.628494  0.629431  0.762789  5  2.0 NaN
2013-01-04  0.258177  0.418438 -0.606970  5  3.0 NaN

In [109]:
df

                   A         B         C  D    F
2013-01-01  0.000000  4.000000  0.476925  5  NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0
2013-01-03 -0.628494  0.629431  0.762789  5  2.0
2013-01-04  0.258177  0.418438 -0.606970  5  3.0
2013-01-05 -1.387399  1.152705  1.637160  5  4.0
2013-01-06 -0.908842 -1.789763 -1.608295  5  5.0

In [110]:
pd.isna(df1)

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True

In [111]:
df.mean()

A   -0.276805
B    0.765264
C    0.164692
D    5.000000
F    3.000000
dtype: float64

In [112]:
df.mean(1)

2013-01-01    2.369231
2013-01-02    1.502609
2013-01-03    1.552745
2013-01-04    1.613929
2013-01-05    2.080493
2013-01-06    1.138620
Freq: D, dtype: float64

In [113]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [114]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [116]:
df

                   A         B         C  D    F
2013-01-01  0.000000  4.000000  0.476925  5  NaN
2013-01-02  1.005726  0.180774  0.326544  5  1.0
2013-01-03 -0.628494  0.629431  0.762789  5  2.0
2013-01-04  0.258177  0.418438 -0.606970  5  3.0
2013-01-05 -1.387399  1.152705  1.637160  5  4.0
2013-01-06 -0.908842 -1.789763 -1.608295  5  5.0

In [115]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.628494 -0.370569 -0.237211  4.0  1.0
2013-01-04 -2.741823 -2.581562 -3.606970  2.0  0.0
2013-01-05 -6.387399 -3.847295 -3.362840  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [117]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  4.000000  0.476925   5   NaN
2013-01-02  1.005726  4.180774  0.803469  10   1.0
2013-01-03  0.377232  4.810205  1.566259  15   3.0
2013-01-04  0.635408  5.228643  0.959288  20   6.0
2013-01-05 -0.751990  6.381348  2.596448  25  10.0
2013-01-06 -1.660832  4.591586  0.988153  30  15.0

In [120]:
df.apply(lambda x: x.max() - x.min())

A    2.393125
B    5.789763
C    3.245455
D    0.000000
F    4.000000
dtype: float64

In [121]:
s = pd.Series(np.random.randint(0, 7, size=10))
ss

0    2
1    0
2    5
3    2
4    0
5    5
6    4
7    5
8    1
9    0
dtype: int64

In [122]:
s.value_counts()

5    3
0    3
2    2
4    1
1    1
dtype: int64

In [125]:
s = pd.Series(['A','B','C','D',np.nan,'aaba','baca','cat','CABA','dog'])

In [126]:
s

0       A
1       B
2       C
3       D
4     NaN
5    aaba
6    baca
7     cat
8    CABA
9     dog
dtype: object

In [127]:
s.str.lower()

0       a
1       b
2       c
3       d
4     NaN
5    aaba
6    baca
7     cat
8    caba
9     dog
dtype: object

In [128]:
df = pd.DataFrame(np.random.randn(10,4))

In [129]:
df

          0         1         2         3
0  0.093511 -0.291363 -0.480919  2.202416
1 -2.078409 -1.362929  0.848759 -0.395167
2 -0.952541  0.402448  0.770495 -1.049200
3 -0.893184 -0.069238  0.173159  0.401832
4  0.277951  0.602805 -1.267015 -0.582716
5  0.849138 -0.060097 -1.527208  1.302449
6 -1.319903 -0.228183 -1.290072 -0.098834
7 -0.730836  1.076667  1.468438 -0.387557
8 -0.832397 -0.043610 -0.572185  1.585704
9 -0.211586 -0.663184 -0.137630 -0.035671

In [133]:
# break into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [134]:
pieces

[          0         1         2         3
 0  0.093511 -0.291363 -0.480919  2.202416
 1 -2.078409 -1.362929  0.848759 -0.395167
 2 -0.952541  0.402448  0.770495 -1.049200,
           0         1         2         3
 3 -0.893184 -0.069238  0.173159  0.401832
 4  0.277951  0.602805 -1.267015 -0.582716
 5  0.849138 -0.060097 -1.527208  1.302449
 6 -1.319903 -0.228183 -1.290072 -0.098834,
           0         1         2         3
 7 -0.730836  1.076667  1.468438 -0.387557
 8 -0.832397 -0.043610 -0.572185  1.585704
 9 -0.211586 -0.663184 -0.137630 -0.035671]

In [135]:
pd.concat(pieces)

          0         1         2         3
0  0.093511 -0.291363 -0.480919  2.202416
1 -2.078409 -1.362929  0.848759 -0.395167
2 -0.952541  0.402448  0.770495 -1.049200
3 -0.893184 -0.069238  0.173159  0.401832
4  0.277951  0.602805 -1.267015 -0.582716
5  0.849138 -0.060097 -1.527208  1.302449
6 -1.319903 -0.228183 -1.290072 -0.098834
7 -0.730836  1.076667  1.468438 -0.387557
8 -0.832397 -0.043610 -0.572185  1.585704
9 -0.211586 -0.663184 -0.137630 -0.035671

In [137]:
type(pieces)

list